{
   "products":[
   {
      "id": "1",
      "title": "Nike Air Force 1 '07 FlyEase",
      "description": "Quicker than 1, 2, 3—the original hoops shoe lets you step in and get going. Its easy-entry FlyEase system gives you a hands-free experience, while crisp leather dons the cleanest colour for ultimate wearability. Yeah, it's everything you love and then some.",
      "price": 110,
      "rating": 3,
      "imageURL": "https://static.nike.com/a/images/t_PDP_864_v1/f_auto,b_rgb:f5f5f5/13721f24-2774-443e-a27d-998d2c6be068/air-force-1-07-flyease-shoes-LKXPhZ.png",
      "videoURL": "https://static.nike.com/a/videos/q_90,vc_vp9/476d28cd-731a-41fc-9bb5-0d2877aae7bd/video.webm"
   },
   {
      "id": "2",
      "title": "Nike Air Max Impact 4",
      "description": "Elevate your game and your hops. Charged with Max Air cushioning in the heel, this lightweight, secure shoe helps you get off the ground confidently and land comfortably. Plus, rubber wraps up the sides for added durability and stability.",
      "price": 90,
      "rating": 5,
      "imageURL": "https://static.nike.com/a/images/t_PDP_864_v1/f_auto,b_rgb:f5f5f5/8142d726-b5ac-4917-a60e-7e6e8889e766/air-max-impact-4-basketball-shoes-nmn08j.png",
      "videoURL": "https://static.nike.com/a/videos/q_90,vc_vp9/4e76e4ff-8885-4ebd-93f9-ba463c66e981/video.webm"
   },
   {
      "id": "3",
      "title": "Nike Court Vision Low",
      "description": "In love with the classic look of '80s basketball, but craving casual comfort? Meet the Court Vision Low. A vibrant Swoosh pops against the soft leather to give this old-school hoops icon a classic look. A plush, low-cut collar keeps the design feeling modern and comfortable.",
      "price": 110,
      "rating": 4,
      "imageURL": "https://static.nike.com/a/images/t_PDP_864_v1/f_auto,b_rgb:f5f5f5/16cd3ba0-5496-43ea-b75d-15044501f0dc/court-vision-low-shoes-W2bfvt.png",
      "videoURL": ""
   },
   {
      "id": "4",
      "title": "Jordan One Take 4 PF",
      "description": "Get that speed you need, just like Russ. Inspired by Russell Westbrook's latest signature shoe, the outsole of the Jordan One Take 4 wraps up nearly to the midsole so you can start, stop or change direction in an instant. Meanwhile, energy-returning Zoom Air cushioning in the forefoot keeps you goin' (and goin' and goin').",
      "price": 110,
      "rating": 4,
      "imageURL": "https://static.nike.com/a/images/t_PDP_864_v1/f_auto,b_rgb:f5f5f5/02ffc2b7-a1a7-4eb7-9fe7-9d211dcffc94/jordan-one-take-4-pf-shoes-cdsVn1.png",
      "videoURL": ""
   },
   {
      "id": "5",
      "title": "Nike Renew Elevate 3",
      "description": "Level up your game on both ends of the floor in the Nike Renew Elevate 3. Specifically tuned for 2-way players who want to make an impact offensively and defensively, this shoe helps you optimise your ability with all-game, all-season support and stability. Improved traction and arch support enhance cutting and pivoting, which can make the difference down the stretch.",
      "price": 85,
      "rating": 4,
      "imageURL": "https://static.nike.com/a/images/t_PDP_864_v1/f_auto,b_rgb:f5f5f5/86f0b37c-0c3e-4a12-afab-fca5c17ff1b2/zion-2-full-moon-pf-basketball-shoes-fTg9sH.png",
      "videoURL": ""
   },
   {
      "id": "6",
      "title": "Zion 2 'Full Moon' PF",
      "description": "Zion loves the city of New Orleans. After all, it's where he got his start as a pro baller—and where he continues to shine. Celebrate his journey with this edition of the Zion 2, inspired by the moon's biggest and brightest phase. Canvas and hemp come together, representing abundance and hard work coming to fruition. Of course, it's also stacked with the court-ready features you know and love. Get ready for your own transformation, in the light of the Zion 2 'Full Moon'.",
      "price": 104,
      "rating": 4,
      "imageURL": "https://static.nike.com/a/images/t_PDP_864_v1/f_auto,b_rgb:f5f5f5/af4e8cbb-e93a-4652-8f85-93d6515390ff/renew-elevate-3-basketball-shoes-QT43Gj.png",
      "videoURL": ""
   },
   {
      "id": "7",
      "title": "Nike Air Flight Huarache",
      "description": "Nobody does basketball like us, and that means no one brings 'em back like we do. Straight from the vault, the Air Flight Huarache is back—returning you to one of the most memorable eras of the hoops-to-street revolution. These original colourways are just the beginning of your trip down memory lane—from the collar cut-outs to the Air logo on the heel, this '92 classic scratches your itch for nostalgia. But not everything new is old: Nike Air cushioning in the heel and forefoot bring an iconic design into the future. Ready to give your foot a hug today?",
      "price": 110,
      "rating": 4,
      "imageURL": "https://static.nike.com/a/images/t_PDP_864_v1/f_auto,b_rgb:f5f5f5/be3d1b40-a830-47e1-845b-53494b3692af/air-flight-huarache-shoes-gRWpBG.png",
      "videoURL": ""
   },
   {
      "id": "8",
      "title": "Nike Pegasus 40 SE",
      "description": "A springy ride for every run, the Peg's familiar, just-for-you feel returns to help you accomplish your goals. This version has the same responsiveness and neutral support you love but with improved comfort in those sensitive areas of your foot, like the arch and toes. Whether you're logging long marathon miles, squeezing in a speed session before the sun goes down or hopping into a spontaneous group jaunt, it's still the established road runner you can put your faith in, day after day, run after run. Sharp, bright hues complement dark-room-colour neutrals, speaking to an inclusive world where digital and physical coexist in harmony.",
      "price": 112,
      "rating": 5,
      "imageURL": "https://static.nike.com/a/images/t_PDP_864_v1/f_auto,b_rgb:f5f5f5/3151049d-1841-440d-b6f9-84ec8663837d/pegasus-40-se-road-running-shoes-JM1hs5.png",
      "videoURL": ""
   },
   {
      "id": "9",
      "title": "Nike Pegasus Turbo Next Nature SE",
      "description": "Let this esteemed stallion help you log the hard miles. Complete with lighter, responsive foam and a feathery upper, this motley-coloured mare helps you increase tempo without sacrificing comfort as you push towards a personal best. Sharp, bright hues complement dark-room colour neutrals, speaking to an inclusive world where digital and physical coexist in harmony.",
      "price": 135,
      "rating": 3,
      "imageURL": "https://static.nike.com/a/images/t_PDP_864_v1/f_auto,b_rgb:f5f5f5/50d4f5e6-31a3-46ac-80ec-6ea16150f469/pegasus-turbo-next-nature-se-road-running-shoes-3xV3VW.png",
      "videoURL": ""
   },
   {
      "id": "10",
      "title": "Nike Go FlyEase",
      "description": "Ditch the laces and get outside. These kicks feature Nike's revolutionary FlyEase technology, making on-and-off a breeze. With a heel that pivots open for a totally hands-free entry, they're great for people with limited mobility—or anyone who wants a quicker way to get going.",
      "price": 118,
      "rating": 5,
      "imageURL": "https://static.nike.com/a/images/t_PDP_864_v1/f_auto,b_rgb:f5f5f5/c76e2119-acb7-4944-9085-d4f5ae2bda4a/go-flyease-easy-on-off-shoes-3svRCL.png",
      "videoURL": "https://static.nike.com/a/videos/q_90,vc_vp9/8751dcb1-864b-4ab0-bdd3-9b873780f7e7/video.webm"
   }
]
}
